# Document Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..Document Property
Element Class See Also
---
Returns the Document in which the Element resides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# Remarks
All elements are contained within a document. An element can be retrieved from this document by using the id that is returned by the element's id property.
# See Also
Element Class
Autodesk.Revit.DB Namespace